In [1]:
import numpy as np
import pandas as pd

In [4]:
data = pd.read_csv('pre-process_datasample.csv')

In [6]:
#Understand if there exists missing values
#Understand the datatype for each column
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      9 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 400.0+ bytes

In [9]:
data['Age']

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [14]:
#Handle Missing Data
#Age and Salary ---> Mean (Numeric)
#Country ----------> Mode (Categorical)

#fillna()

data['Age'].fillna(int(data.Age.mean()) , inplace=True)
data['Salary'].fillna(data.Salary.mean() , inplace=True)
data['Country'].fillna(data.Country.mode()[0] , inplace=True)
data

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8   France  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [15]:
data.Age.median()

38.0

In [18]:
#Handling Categorical Data
#Dummy Variables --> Stats Concept

pd.concat([pd.get_dummies(data.Country) , data.iloc[:,1:] ], axis =1)

   France  Germany  Spain   Age        Salary Purchased
0       1        0      0  44.0  72000.000000        No
1       0        0      1  27.0  48000.000000       Yes
2       0        1      0  30.0  54000.000000        No
3       0        0      1  38.0  61000.000000        No
4       0        1      0  40.0  63777.777778       Yes
5       1        0      0  35.0  58000.000000       Yes
6       0        0      1  38.0  52000.000000        No
7       1        0      0  48.0  79000.000000       Yes
8       1        0      0  50.0  83000.000000        No
9       1        0      0  37.0  67000.000000       Yes